In [6]:
import pandas as pd
import numpy as np
import os

In [7]:
ls

cat_estacion.csv     Datos_para_entrenar.ipynb  Limpieza_dia.ipynb
Concatenacion.ipynb  Datos_Procedados/          Limpieza_hora.ipynb
Datos/               Fotos/                     Modelos/
Datos_dia.ipynb      HISTORICO/

In [8]:
cd RAMA

[Errno 2] No such file or directory: 'RAMA'
/home/alberto/Documentos/Proyecto_Mineria

In [9]:
ls

cat_estacion.csv     Datos_para_entrenar.ipynb  Limpieza_dia.ipynb
Concatenacion.ipynb  Datos_Procedados/          Limpieza_hora.ipynb
Datos/               Fotos/                     Modelos/
Datos_dia.ipynb      HISTORICO/

In [10]:
df = pd.read_excel('/home/alberto/Documentos/Proyecto_Mineria/Datos/RAMA/2008PM25.xls')

In [11]:
df.describe()

,HORA,MER,TLA,COY,UIZ,SJA,SAG,PER,CAM,ACO
count,8784.000000,8784.000000,8784.000000,8784.000000,8784.000000,8784.000000,8784.000000,8784.000000,8784.000000,8784.000000
mean,12.500000,17.033128,20.039048,13.429076,-6.317509,11.252618,17.531421,25.663479,20.549294,4.653005
std,6.922581,36.378730,35.136927,36.856229,56.206836,42.336736,35.416096,44.432366,35.350142,44.587571
min,1.000000,-99.000000,-99.000000,-99.000000,-99.000000,-99.000000,-99.000000,-99.000000,-99.000000,-99.000000
25%,6.750000,14.000000,14.000000,10.000000,-99.000000,11.000000,12.000000,14.000000,15.000000,7.000000
50%,12.500000,23.000000,24.000000,20.000000,16.000000,21.000000,22.000000,27.000000,26.000000,17.000000
75%,18.250000,34.000000,36.000000,31.000000,29.000000,32.000000,34.000000,46.000000,38.000000,28.000000
max,24.000000,147.000000,160.000000,115.000000,186.000000,185.000000,207.000000,507.000000,210.000000,204.000000

In [12]:
df.replace(99,-99, inplace=True)

In [13]:
df = df.replace(-99, np.nan)

In [14]:
df.head()

,FECHA,HORA,MER,TLA,COY,UIZ,SJA,SAG,PER,CAM,ACO
0,2008-01-01,1,39.0,47.0,38.0,49.0,67.0,77.0,91.0,62.0,39.0
1,2008-01-01,2,65.0,91.0,46.0,113.0,104.0,120.0,137.0,98.0,87.0
2,2008-01-01,3,82.0,123.0,64.0,136.0,NaN,164.0,185.0,102.0,118.0
3,2008-01-01,4,97.0,160.0,72.0,135.0,NaN,197.0,273.0,132.0,111.0
4,2008-01-01,5,97.0,112.0,75.0,133.0,113.0,193.0,290.0,74.0,139.0

In [15]:
df.head()

,FECHA,HORA,MER,TLA,COY,UIZ,SJA,SAG,PER,CAM,ACO
0,2008-01-01,1,39.0,47.0,38.0,49.0,67.0,77.0,91.0,62.0,39.0
1,2008-01-01,2,65.0,91.0,46.0,113.0,104.0,120.0,137.0,98.0,87.0
2,2008-01-01,3,82.0,123.0,64.0,136.0,NaN,164.0,185.0,102.0,118.0
3,2008-01-01,4,97.0,160.0,72.0,135.0,NaN,197.0,273.0,132.0,111.0
4,2008-01-01,5,97.0,112.0,75.0,133.0,113.0,193.0,290.0,74.0,139.0

In [16]:
#df1=df.pivot_table(columns='HORA')

In [17]:
df1.head()

NameError: name 'df1' is not defined

In [ ]:
df1 = df[['FECHA','HORA','TAC']].copy()

In [ ]:
df1.head()

In [ ]:
df1.describe()

In [ ]:
#df.drop('HORA',inplace=True,axis=1)

In [ ]:
df1.head()

In [ ]:
Prom=df.mean(axis=1)

In [ ]:
Max=df.max(axis=1)

In [ ]:
Min=df.min(axis=1)

In [ ]:
df.eval("Min= @Min.values", inplace=True)

In [ ]:
df.eval("Max= @Max.values", inplace=True)

In [ ]:
df.eval("Prom = @Prom.values", inplace=True)

In [ ]:
df.head()

In [ ]:
#df['Max'].describe()

In [ ]:
Pro_03 = df[['Hora','Fecha','Prom','Min','Max']].copy()

In [ ]:
Pro_03.head()

In [ ]:
Pro_03.describe()

In [ ]:
Pro_03.to_excel('Datos_2008PM25.xlsx')

In [ ]:
#gr = df.groupby('FECHA')

In [ ]:
#df.describe()